[
  {
    "Id": "935230",
    "ThreadId": "401545",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Will you be creating a new &quot;beta&quot; version with all the recent changes included? I tried to download/compile the source but since I'm using VS2012 (that doesn't supports anymore the VS2010 installer type), I can't compile it.</p>\r\n<p>It's also missing some .dll related to the VS console, not sure why because I have the VS SDK installed in my machine (I'm even using it for another project).</p>\r\n<p>I already tried to find/replace the missing .dlls inside the VS SDK install, but even doing so, it seems that the signatures of some methods changed in between...</p>\r\n",
    "PostedDate": "2012-11-01T05:40:37.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "939440",
    "ThreadId": "401545",
    "Html": "<p>Chirpy use nuGet for dll.</p>\r\n<p>Active in your vs 2012 nuGet download.</p>\r\n<p>Tools &gt; Options</p>\r\n<p>Package Manager</p>\r\n<p>Check option \"Allow NuGet to download missing packages during build\".</p>",
    "PostedDate": "2012-11-09T17:08:15.687-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "941551",
    "ThreadId": "401545",
    "Html": "\r\n<p>That doesn't seems to be the issue. I checked and all the packages are ok.</p>\r\n<p>The problems I get are related to VS SDK. For example, on the Zippy.Chirp project, I'm missing the Microsoft.VisualStudio.Shell reference. I don't have any &quot;Shell&quot; only item in my assemblies. I only have the ones that ends with &quot;Interop&quot; (from 7 to 10).</p>\r\n<p>I found the&nbsp;Microsoft.VisualStudio.Shell.dll on the VS folder, under the &quot;PrivateAssemblies&quot; folder. I'm able to build chirpy (had to change the target platform to .net 4.5 because this new dll was built against that), but on the post build, ILMerge throws\r\n an error because that assembly now it seems to be private: &quot;An exception occurred during merging: Unresolved assembly reference not allowed: Microsoft.VisualStudio.Shell.&quot;</p>\r\n<p>Not sure how to continue...</p>\r\n",
    "PostedDate": "2012-11-14T05:00:56.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "944356",
    "ThreadId": "401545",
    "Html": "\r\n<p>I double that - can't build on VS12. Voting for the new BETA build.</p>\r\n",
    "PostedDate": "2012-11-19T22:09:26.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]